#include "key.h"

/**************************************************************************
函数功能：按键初始化
入口参数：无
返回  值：无 
**************************************************************************/
void KEY_Init(void)
{
	RCC->APB2ENR|=1<<2;               //使能PORTA时钟	   	 
	GPIOA->CRL&=0XFF0FFFFF;           
	GPIOA->CRL|=0X00800000;           
  GPIOA->ODR|=1<<5; //   上拉	
} 

/***************************************************************************
函数功能：按键扫描
					该函数可直接在主函数的while(1)里使用
					暂时没用
****************************************************************************/
void KeyStatus_scan(void)
{
	if(KEY==0)	//检测到按下
	{
		delay_ms(10);	//消抖
	//再次确认按下	
	//记录当前状态，并准备加入序列
		if(KEY==0)		Bottom_StatusTemp=1;	//按下了，按键电路导通中，	用1表示
		else					Bottom_StatusTemp=0;	//没按下，--------------		用0表示
	}
	     
	//状态序列更新
	Bottom_Status1 = Bottom_Status2 ;			
	Bottom_Status2 = Bottom_StatusTemp;
	
	//状态序列监测
	//如果前一状态是1，紧接着是0；表明完成了一个“按下、松开”的动作，即click
	if(	( (Bottom_Status1==1)&&(Bottom_Status2==0) ) ==1	)	
				Flag_Click=1;
	else 	Flag_Click=0;
}
